[
  {
    "title": "SakiFi",
    "description": "SakiFi is a practical and reliable platform that serves as a reference hub for Sharia-compliant financial transactions. It provides curated articles, verified documents, and academic references sourced from Islamic jurisprudence (fiqh muamalah) to help users understand the halal standards of modern contracts. Built with a focus on accessibility, clarity, and trustworthiness, SakiFi aims to bridge the gap between technology and Sharia finance literacy.",
    "story": "SakiFi was born out of my own confusion and difficulty in finding clear, reliable information about Islamic financial rulings — such as how to calculate zakat, determine nisab and haul, or understand contract standards according to Sharia principles. I wanted a single place that consolidates all these essentials, backed by credible references. That desire eventually evolved into a comprehensive digital reference platform for Sharia-compliant transactions.",
    "image": "/portfolios/sakifi.svg",
    "tech": ["CSS", "JavaScript", "Next.js"],
    "links": [
      {
        "link": "https://sakifi.vercel.app",
        "desc": ""
      }
    ]
  },
  {
    "title": "Mojepict",
    "description": "Mojepict is a collection of versatile and user-friendly online tools designed to simplify daily digital workflows. From quick image editing to file conversion, color palette generation, and text utilities — Mojepict combines multiple handy mini-tools in one accessible place. It’s crafted with modern UI/UX principles for seamless and fast performance, making everyday creative tasks effortless and enjoyable.",
    "story": "The idea for Mojepict came from my daily experience — both at work and during personal projects — where I often needed simple tools like image editors, converters, or color extractors. Most of the available sites were heavy, cluttered with ads, or required multiple separate tools for small tasks. I decided to build Mojepict as a lightweight, all-in-one toolbox that’s ad-free, fast, and pleasant to use.",
    "image": "/portfolios/mojepict.svg",
    "tech": ["CSS", "JavaScript", "Tailwind CSS", "Next.js"],
    "links": [
      {
        "link": "https://mojepict.vercel.app",
        "desc": ""
      }
    ]
  },
  {
    "title": "Randomix",
    "description": "Randomix is a smart and engaging platform that automatically generates balanced and fair teams for games or group activities. Users can input player names with corresponding skill levels — beginner, intermediate, or pro — and the system uses an algorithm to create evenly matched teams. Designed for both casual gamers and sports enthusiasts, Randomix delivers fairness, simplicity, and fun in every draw.",
    "story": "Randomix emerged from my own struggles when organizing sports games or friendly matches with friends. Dividing teams fairly based on player skill levels was often messy — teams ended up unbalanced, and the process took too long. I wanted something smarter, that could also generate tournament brackets (who plays who, and who advances next) while being easy to share. That’s how Randomix came to life: as a balance-focused and social-friendly team generator.",
    "image": "/portfolios/randomix.svg",
    "tech": ["CSS", "JavaScript", "Tailwind CSS", "Nuxt.js"],
    "links": [
      {
        "link": "https://randomix.vercel.app",
        "desc": ""
      }
    ]
  },
  {
    "title": "Voyage Pulse",
    "description": "Voyage Pulse is a lightweight yet powerful analytics dashboard that helps website owners track visitor behavior and engagement. It monitors page visits, outbound clicks, file downloads, and user geolocation with real-time visualization. Designed with a clean interface and powered by Supabase and Node.js, Voyage Pulse brings clarity to analytics — offering actionable insights without the complexity of traditional analytics tools.",
    "story": "Voyage Pulse began as a personal curiosity. I wanted to understand how people interacted with my own projects — which pages they visited, what they clicked, and which features were most used. Instead of relying on large analytics tools, I aimed to create something lightweight, privacy-friendly, and focused on core insights. Voyage Pulse became my way of visualizing engagement data simply, yet meaningfully.",
    "image": "/portfolios/voyagepulse.svg",
    "tech": [
      "CSS",
      "JavaScript",
      "Ant Design",
      "React.js",
      "Supabase",
      "Node.js"
    ],
    "links": [
      {
        "link": "https://voyagepulse.netlify.app",
        "desc": ""
      }
    ]
  },
  {
    "title": "Vistee",
    "description": "Vistee is a modern web-based visual CV builder that empowers users to create stunning, professional resumes in minutes. With live editing, customizable templates, and an intuitive drag-and-drop interface, users can design resumes that reflect their personality and professional identity. Built for freelancers, students, and professionals alike, Vistee focuses on accessibility, speed, and visual appeal — making personal branding effortless.",
    "story": "Vistee was inspired by my own and my friends’ struggles in crafting CVs. We often spent hours finding design inspiration, choosing the right words, and aligning elements manually. I wanted to simplify the process — to make it fast yet flexible, with templates that could adapt to anyone’s style. Vistee was born as a smart CV builder that merges speed, beauty, and personalization in one smooth experience.",
    "image": "/portfolios/vistee.svg",
    "tech": ["CSS", "JavaScript", "Ant Design", "React.js"],
    "links": [
      {
        "link": "https://vistee.vercel.app",
        "desc": ""
      }
    ]
  }
]
