[
  {
    "title": "Muhammadiyah Expo 2023",
    "description": "A comprehensive registration and information portal for the Muhammadiyah Expo Yogyakarta 2023, featuring an intuitive interface for participant registration, exhibitor listings, and event schedule updates. Built to support seamless digital engagement throughout the event.",
    "image": "/projects/Muhammadiyah-Expo.svg",
    "tech": ["CSS", "JavaScript", "React.js", "Laravel"],
    "links": []
  },
  {
    "title": "Darussalam Turgo",
    "description": "An informative profile website for Darussalam Turgo Islamic Boarding School, designed to highlight its educational programs, orphan empowerment initiatives, and community development activities in Boyolali. Focused on simplicity and spiritual warmth.",
    "image": "/projects/Darussalam-Turgo.svg",
    "tech": ["HTML", "CSS", "JavaScript"],
    "links": [
      {
        "link": "https://darussalamturgo.vercel.app",
        "desc": ""
      }
    ]
  },
  {
    "title": "Team Up",
    "description": "A digital matchmaking platform built to connect startup founders with compatible team members and co-founders. Developed in collaboration with the 1000 Digital Startups Yogyakarta 2023 program, it streamlines the talent-matching process for early-stage startups.",
    "image": "/projects/Team-Up.svg",
    "tech": ["Tailwind CSS", "JavaScript", "React.js", "Laravel"],
    "links": [
      {
        "link": "https://team-up.id",
        "desc": ""
      }
    ]
  },
  {
    "title": "Sandbox Official Website",
    "description": "A modern corporate website for PT Sandbox Indonesia Juara, designed to showcase the company’s innovation-driven approach and digital solutions portfolio. Features a clean layout, responsive design, and dynamic content structure.",
    "image": "/projects/Sandbox.svg",
    "tech": ["Bootstrap", "JavaScript", "React.js", "Django"],
    "links": [
      {
        "link": "https://sandboxindonesia.id",
        "desc": ""
      }
    ]
  },
  {
    "title": "Simpus",
    "description": "A digital information system for managing administrative and service operations within community health centers (Puskesmas). It helps healthcare staff efficiently record, track, and analyze patient and operational data through an intuitive web interface.",
    "image": "/projects/Simpus.svg",
    "tech": [
      "Tailwind CSS",
      "Bootstrap",
      "JavaScript",
      "React.js",
      "Laravel",
      "Golang"
    ],
    "links": []
  },
  {
    "title": "Simpatiku — Admin & Landing Page",
    "description": "An integrated public service management platform for Kutai Timur Regency, combining a modern landing page with a comprehensive admin dashboard for managing regional data and services. Built for scalability and efficiency.",
    "image": "/projects/Simpatiku.svg",
    "tech": ["Bootstrap", "JavaScript", "React.js", "Django"],
    "links": [
      {
        "link": "https://simpatiku.kutaitimurkab.go.id",
        "desc": "Landing page"
      },
      {
        "link": "https://dash-simpatiku.kutaitimurkab.go.id",
        "desc": "Admin"
      }
    ]
  },
  {
    "title": "Siap",
    "description": "A web-based land administration information system equipped with geospatial visualization for land parcels and ownership data. Designed to improve transparency and accessibility in land management through interactive map integration.",
    "image": "/projects/Siap.svg",
    "tech": ["Bootstrap", "JavaScript", "React.js", "Leaflet", "Django"],
    "links": [
      {
        "link": "https://siap.kutaitimurkab.go.id",
        "desc": ""
      }
    ]
  },
  {
    "title": "Siperjadin",
    "description": "A government business trip management platform that automates the process of travel authorization, expense reporting, and approval workflows. It streamlines administrative tasks and ensures compliance with internal regulations.",
    "image": "/projects/Siperjadin.svg",
    "tech": ["Bootstrap", "JavaScript", "React.js", "Golang"],
    "links": [
      {
        "link": "https://siperjadin.id",
        "desc": ""
      }
    ]
  },
  {
    "title": "Profitku — Admin & Landing Page",
    "description": "An integrated enterprise management solution offering modules for performance evaluation, SWOT analysis, KPI tracking, and organizational analytics. Designed to support companies and institutions in strategic decision-making through data visualization.",
    "image": "/projects/Profitku.svg",
    "tech": ["Bootstrap", "JavaScript", "React.js", "Golang"],
    "links": [
      {
        "link": "https://profitku.id",
        "desc": "Landing page"
      },
      {
        "link": "https://app.profitku.id",
        "desc": "Admin"
      }
    ]
  },
  {
    "title": "Sifortuna — Admin & Landing Page",
    "description": "A national-scale agricultural data and forecasting platform designed for monitoring plant pest and disease (OPT) distribution using geospatial data visualization. Integrates Leaflet, Django, and Google Earth Engine for precision agriculture insights.",
    "image": "/projects/Sifortuna.svg",
    "tech": [
      "Bootstrap",
      "JavaScript",
      "React.js",
      "Leaflet",
      "Django",
      "GEE",
      "Google Colab"
    ],
    "links": [
      {
        "link": "https://sifortuna-bbpopt.org",
        "desc": "Landing Page & Admin"
      }
    ]
  },
  {
    "title": "Kanal Tapem",
    "description": "A digital information hub supporting regional governance and administrative transparency. Designed to centralize public information and policy updates under the regional secretariat division.",
    "image": "/projects/Kanal-Tapem.svg",
    "tech": ["Bootstrap", "JavaScript", "React.js", "Golang"],
    "links": []
  },
  {
    "title": "Disambi — Admin & Self-Service Kiosk",
    "description": "A digital public service ecosystem for Sambirejo Village, Yogyakarta. It features an admin portal and a self-service kiosk interface, empowering citizens to access village services independently and transparently.",
    "image": "/projects/Disambi.svg",
    "tech": ["Bootstrap", "JavaScript", "React.js", "Golang"],
    "links": [
      {
        "link": "https://disambi.id",
        "desc": "Admin"
      },
      {
        "link": "https://disambi.id/anjungan",
        "desc": "Self-Service Kiosk"
      }
    ]
  },
  {
    "title": "Simpan Ternate",
    "description": "A web-based document management and archiving platform for the City of Ternate, designed to support digital transformation and improve accessibility to official records and correspondence.",
    "image": "/projects/Simpan.svg",
    "tech": ["Bootstrap", "JavaScript", "React.js", "Golang"],
    "links": []
  },
  {
    "title": "Desa Pintar — Admin & Landing Page",
    "description": "A smart village platform that brings digital transformation to local governance through integrated admin tools, citizen services, and geospatial visualization. Developed using modern stacks to ensure scalability and smooth UX.",
    "image": "/projects/Despin.svg",
    "tech": [
      "Bootstrap",
      "JavaScript",
      "React.js",
      "Tailwind CSS",
      "Next.js",
      "Leaflet",
      "Django"
    ],
    "links": []
  },
  {
    "title": "Dilan — Admin & Landing Page",
    "description": "A modern digital governance system for villages in Klaten Regency, featuring a modular architecture for regional administration, geospatial visualization, and citizen services — tailored for scalability and local needs.",
    "image": "/projects/Dilan.svg",
    "tech": [
      "Bootstrap",
      "JavaScript",
      "React.js",
      "Tailwind CSS",
      "Next.js",
      "Leaflet",
      "Django"
    ],
    "links": []
  },
  {
    "title": "Adis",
    "description": "A centralized infrastructure management system that streamlines data tracking and reporting for the Adis project. Developed with a responsive design and robust backend integration for reliable data management.",
    "image": "/projects/Adis.svg",
    "tech": ["Bootstrap", "JavaScript", "React.js", "Django"],
    "links": [
      {
        "link": "https://adis.sandboxindonesia.id",
        "desc": ""
      }
    ]
  },
  {
    "title": "React Admin Template Sandbox",
    "description": "A modular and scalable admin template built with React, designed for reusability and rapid development. Refined through real project experience, featuring a clean UI, dynamic routing, and integrated state management.",
    "image": "/projects/Template-Sandbox.svg",
    "tech": ["Bootstrap", "JavaScript", "React.js", "Leaflet", "Django"],
    "links": []
  },
  {
    "title": "Broom",
    "description": "A management platform for booking and scheduling padel courts, providing an efficient interface for venue owners and players alike. Built with attention to detail and user experience for the growing padel community.",
    "image": "/projects/Broom.svg",
    "tech": ["Bootstrap", "JavaScript", "React.js", "Python"],
    "links": [
      {
        "link": "https://broombroom.co.id",
        "desc": "Admin"
      }
    ]
  }
]
